<?php
return [
    'idcard_side' => [
        'front',//身份证含照片的一面
        'back'//身份证带国徽的一面
    ],
    'image_status' => [
        'normal' => '识别正常',
        'reversed_side' => '-身份证正反面颠倒',
        'non_idcard' => '上传的图片中不包含身份证',
        'blurred' => '身份证模糊',
        'other_type_card' => '其他类型证照',
        'over_exposure' => '身份证关键字段反光或过曝',
        'over_dark' => '身份证欠曝（亮度过低）',
        'unknown' => '未知状态'
    ],
    //用于校验身份证号码、性别、出生是否一致，输出结果及其对应关系
    'idcard_number_type' => [
        '-1' => '身份证正面所有字段全为空',
        '0' => '身份证证号不合法，此情况下不返回身份证证号',
        '1' => '身份证证号和性别、出生信息一致',
        '2' => '身份证证号和性别、出生信息都不一致',
        '3' => '身份证证号和出生信息不一致',
        '4' => '身份证证号和性别信息不一致'
    ],
    //输入参数 detect_risk = true 时，则返回该字段识别身份证风险类型:
    'risk_type' => [
        'normal' => '正常身份证',
        'copy' => '复印件',
        'temporary' => '临时身份证',
        'screen' => '翻拍',
        'unknown' => '其他未知情况'
    ]
];